{"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":7293,"status":"ok","timestamp":1665610146847,"user":{"displayName":"Santiago Salazar R","userId":"01329020800944867550"},"user_tz":300},"id":"4oN8C5ImG5gV","outputId":"a67d22b5-16fb-4cdf-9a50-69c5da8c4cd7"},"outputs":[{"name":"stdout","output_type":"stream","text":["Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/\n","Collecting rdflib\n","  Downloading rdflib-6.2.0-py3-none-any.whl (500 kB)\n","\u001b[K     |████████████████████████████████| 500 kB 5.2 MB/s \n","\u001b[?25hRequirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from rdflib) (57.4.0)\n","Collecting isodate\n","  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n","\u001b[K     |████████████████████████████████| 41 kB 313 kB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.7/dist-packages (from rdflib) (3.0.9)\n","Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from rdflib) (5.0.0)\n","Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib) (4.1.1)\n","Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib) (3.9.0)\n","Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from isodate->rdflib) (1.15.0)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.1 rdflib-6.2.0\n"]}],"source":["!pip install rdflib"]},{"cell_type":"markdown","metadata":{"id":"A91AzxDjOsm-"},"source":["# Punto 4"]},{"cell_type":"code","execution_count":45,"metadata":{"executionInfo":{"elapsed":21,"status":"ok","timestamp":1665610146848,"user":{"displayName":"Santiago Salazar R","userId":"01329020800944867550"},"user_tz":300},"id":"zjQgv5CWHhLy"},"outputs":[],"source":["# Punto 4\n","from rdflib import Graph, Literal, BNode, URIRef, Namespace\n","# Creamos un grafo vacio\n","g = Graph()\n"]},{"cell_type":"code","execution_count":46,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":219,"status":"ok","timestamp":1665610333955,"user":{"displayName":"Santiago Salazar R","userId":"01329020800944867550"},"user_tz":300},"id":"gnhiVaDgIpY0","outputId":"57657b4b-0494-4f59-a550-90ce6e99c0d4"},"outputs":[{"data":{"text/plain":["<Graph identifier=N352645eab8e74eee90124ea804c43016 (<class 'rdflib.graph.Graph'>)>"]},"execution_count":46,"metadata":{},"output_type":"execute_result"}],"source":["# Parse a la ontologia\n","g.parse(\"Computador.owl\",format =\"ttl\")"]},{"cell_type":"code","execution_count":47,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":205,"status":"ok","timestamp":1665610507926,"user":{"displayName":"Santiago Salazar R","userId":"01329020800944867550"},"user_tz":300},"id":"vPtshpkXIz5R","outputId":"05097cf2-8e9a-40ab-8639-a75836756bdc"},"outputs":[{"name":"stdout","output_type":"stream","text":["(rdflib.term.Literal('Asus_TUF_Gaming', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('ChromeBook_113180', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Computador_Gamer', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Computador_Hp_250', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Lenovo_IdeaCenter', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Lenovo_Ideapad_3', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Macintosh_128K', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Victus_dlh007', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Victus_dlh008', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('iMac_G3', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('iMac_G4', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('iMac_G5', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n"]}],"source":["# Hora de crear las consultas\n","# Primera consulta\n","# Lo que hace esta consulta es recoger todos los nombres de los individuos\n","consulta1 = \"\"\"\n","PREFIX computador: <http://www.computador.org>\n","SELECT ?nombre\n","WHERE{\n","  ?individuo rdf:type owl:NamedIndividual.\n","  ?individuo rdfs:label ?nombre.\n","}\n","\"\"\"\n","for row in g.query(consulta1):\n","  print(row)"]},{"cell_type":"code","execution_count":48,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":224,"status":"ok","timestamp":1665612095222,"user":{"displayName":"Santiago Salazar R","userId":"01329020800944867550"},"user_tz":300},"id":"Lmzp7mNKNUru","outputId":"fe8362eb-d397-4eba-ec61-ed11d624597b"},"outputs":[{"name":"stdout","output_type":"stream","text":["(rdflib.term.Literal('Board', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('CPU', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Cooler', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('Disco_Duro', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n","(rdflib.term.Literal('GPU', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#string')),)\n"]}],"source":["# Segunda consulta\n","# Se va a recoger los nombres de las clases cuya clase padre sea Parte_Computador\n","consulta2 = \"\"\"\n","PREFIX computador: <http://www.computador.org>\n","SELECT ?nombre\n","WHERE{\n","  ?objeto rdf:type owl:Class;\n","    rdfs:label ?nombre;\n","    rdfs:subClassOf ?propiedad.\n","  ?propiedad rdfs:label ?nombrePropiedad.\n","  FILTER(?nombrePropiedad = \"Parte_Computador\").\n","}\n","\"\"\"\n","for row in g.query(consulta2):\n","  print(row)"]},{"cell_type":"markdown","metadata":{"id":"TW2bM9QWPCMV"},"source":["# Punto 3"]},{"cell_type":"code","execution_count":49,"metadata":{"id":"jb1lSyraOq5Q"},"outputs":[],"source":["# Importamos la libreria SPARQLWrapper\n","from SPARQLWrapper import SPARQLWrapper, POST, DIGEST,JSON\n","\n","# Indicamos el endpoint donde haremos la consulta\n","sparql = SPARQLWrapper(\"https://virtuoso-prod-practica-2-sriw-u6r5p2.mo5.mogenius.io/sparql-auth/\")\n","\n","\n","# Damos las credenciales para hacer la consulta\n","sparql.setHTTPAuth(DIGEST)\n","sparql.setCredentials(\"dba\", \"dba\")\n","sparql.setMethod(POST)"]},{"cell_type":"code","execution_count":57,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["b'<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://www.w3.org/2001/sw/DataAccess/rf1/result2.xsd\">\\n <head>\\n  <variable name=\"callret-0\"/>\\n </head>\\n <results distinct=\"false\" ordered=\"true\">\\n  <result>\\n   <binding name=\"callret-0\"><literal>Insert into &lt;http://www.computador.org/&gt;, 36 (or less) triples -- done</literal></binding>\\n  </result>\\n </results>\\n</sparql>\\n'\n"]}],"source":["# Consulta e insertar con dbpedia\n","consulta = \"\"\"\n","PREFIX dbo: <http://dbpedia.org/ontology/>\n","PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n","PREFIX dbr:  <http://dbpedia.org/resource/>\n","PREFIX dbp: <http://dbpedia.org/datatype/>\n","PREFIX computador: <http://www.computador.org/#>\n","INSERT {GRAPH <http://www.computador.org/> {?Marca rdf:type owl:NamedIndividual. ?Marca rdfs:label ?Nombre.}\n","}\n","where {\n","  SERVICE <https://dbpedia.org/sparql/> {\n","    ?Marca dbo:product dbr:Hard_disk_drive .\n","    ?Marca rdfs:label ?Nombre .\n","    FILTER(LANG(?Nombre ) = \"en\")\n","}\n","}\"\"\"\n","sparql.setQuery(consulta)\n","# Obtenemos el resultado y ejecutamos la consulta\n","results = sparql.query()\n","\n","# imprimimos el resultado\n","print(results.response.read())"]},{"cell_type":"code","execution_count":55,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["b'<sparql xmlns=\"http://www.w3.org/2005/sparql-results#\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://www.w3.org/2001/sw/DataAccess/rf1/result2.xsd\">\\n <head>\\n  <variable name=\"callret-0\"/>\\n </head>\\n <results distinct=\"false\" ordered=\"true\">\\n  <result>\\n   <binding name=\"callret-0\"><literal>Insert into &lt;http://www.computador.org/&gt;, 36 (or less) triples -- done</literal></binding>\\n  </result>\\n </results>\\n</sparql>\\n'\n"]}],"source":["# Consultar e insertar con wikidata\n","consulta = \"\"\"\n","prefix wdt: <http://www.wikidata.org/prop/direct/>\n","prefix wd: <http://www.wikidata.org/entity/>\n","PREFIX computador: <http://www.computador.org/#>\n","INSERT {GRAPH <http://www.computador.org/> {?parteComputador rdfs:subClassOf computador:Parte_Computador.?parteComputador rdfs:label ?parteComputadorLabel.}\n","}\n","WHERE {\n","  SERVICE <https://query.wikidata.org/sparql> {\n","    ?parteComputador wdt:P361 wd:Q68.\n","    ?parteComputador rdfs:label ?parteComputadorLabel.\n","    FILTER( LANG(?parteComputadorLabel) = \"en\" ).\n","  }\n","}\n","\n","\"\"\"\n","sparql.setQuery(consulta)\n","# Obtenemos el resultado y ejecutamos la consulta\n","results = sparql.query()\n","\n","# imprimimos el resultado\n","print(results.response.read())"]}],"metadata":{"colab":{"authorship_tag":"ABX9TyN+s0DdE2slyALZvaKPNj32","provenance":[]},"kernelspec":{"display_name":"Python 3.10.2 64-bit","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.2"},"vscode":{"interpreter":{"hash":"1f89eb7ee7f691a835530315e9cc5d675e01c25354f3226d466fc4ec3dae4d41"}}},"nbformat":4,"nbformat_minor":0}
